Changweibin/TEST/Drivers/FM33LD5xx_FL_Driver/Inc/fm33ld5xx_fl_flash.h
#define    FLASH_IER_PRDIE_Pos                                    (1U)
#define    FLASH_IER_PRDIE_Msk                                    (0x1U << FLASH_IER_PRDIE_Pos)
#define    FLASH_IER_PRDIE                                        FLASH_IER_PRDIE_Msk

#define    FLASH_IER_ERDIE_Pos                                    (0U)
#define    FLASH_IER_ERDIE_Msk                                    (0x1U << FLASH_IER_ERDIE_Pos)
#define    FLASH_IER_ERDIE                                        FLASH_IER_ERDIE_Msk

#define    FLASH_ISR_KEYSTA_Pos                                   (17U)
#define    FLASH_ISR_KEYSTA_Msk                                   (0x7U << FLASH_ISR_KEYSTA_Pos)
#define    FLASH_ISR_KEYSTA                                       FLASH_ISR_KEYSTA_Msk

#define    FLASH_ISR_LVERR_Pos                                    (12U)
#define    FLASH_ISR_LVERR_Msk                                    (0x1U << FLASH_ISR_LVERR_Pos)
#define    FLASH_ISR_LVERR                                        FLASH_ISR_LVERR_Msk

#define    FLASH_ISR_AUTHERR_Pos                                  (10U)
#define    FLASH_ISR_AUTHERR_Msk                                  (0x1U << FLASH_ISR_AUTHERR_Pos)
#define    FLASH_ISR_AUTHERR                                      FLASH_ISR_AUTHERR_Msk

#define    FLASH_ISR_KEYERR_Pos                                   (9U)
#define    FLASH_ISR_KEYERR_Msk                                   (0x1U << FLASH_ISR_KEYERR_Pos)
#define    FLASH_ISR_KEYERR                                       FLASH_ISR_KEYERR_Msk

#define    FLASH_ISR_CKERR_Pos                                    (8U)
#define    FLASH_ISR_CKERR_Msk                                    (0x1U << FLASH_ISR_CKERR_Pos)
#define    FLASH_ISR_CKERR                                        FLASH_ISR_CKERR_Msk

#define    FLASH_ISR_PRD_Pos                                      (3U)
#define    FLASH_ISR_PRD_Msk                                      (0x1U << FLASH_ISR_PRD_Pos)
#define    FLASH_ISR_PRD                                          FLASH_ISR_PRD_Msk

#define    FLASH_ISR_ERD_Pos                                      (0U)
#define    FLASH_ISR_ERD_Msk                                      (0x7U << FLASH_ISR_ERD_Pos)
#define    FLASH_ISR_ERD                                          FLASH_ISR_ERD_Msk

//#define    FLASH_ERRIER_IE_Pos                                    (2U)
//#define    FLASH_ERRIER_IE_Msk                                    (0x1U << FLASH_ERRIER_IE_Pos)
//#define    FLASH_ERRIER_IE                                        FLASH_ERRIER_IE_Msk

#define    FLASH_CECCSR_CD_Pos                                    (31U)
#define    FLASH_CECCSR_CD_Msk                                    (0x1U << FLASH_CECCSR_CD_Pos)
#define    FLASH_CECCSR_CD                                        FLASH_CECCSR_CD_Msk

#define    FLASH_CECCSR_CC_Pos                                    (30U)
#define    FLASH_CECCSR_CC_Msk                                    (0x1U << FLASH_CECCSR_CC_Pos)
#define    FLASH_CECCSR_CC                                        FLASH_CECCSR_CC_Msk

#define    FLASH_CECCSR_BE_Pos                                    (27U)
#define    FLASH_CECCSR_BE_Msk                                    (0x1U << FLASH_CECCSR_BE_Pos)
#define    FLASH_CECCSR_BE                                        FLASH_CECCSR_BE_Msk

#define    FLASH_CECCSR_ADDR_Pos                                  (0U)
#define    FLASH_CECCSR_ADDR_Msk                                  (0xfffffU << FLASH_CECCSR_ADDR_Pos)
#define    FLASH_CECCSR_ADDR                                      FLASH_CECCSR_ADDR_Msk

#define    FLASH_CECCSR_CD_Pos                                    (31U)
#define    FLASH_CECCSR_CD_Msk                                    (0x1U << FLASH_CECCSR_CD_Pos)
#define    FLASH_CECCSR_CD                                        FLASH_CECCSR_CD_Msk

#define    FLASH_CECCSR_CC_Pos                                    (30U)
#define    FLASH_CECCSR_CC_Msk                                    (0x1U << FLASH_CECCSR_CC_Pos)
#define    FLASH_CECCSR_CC                                        FLASH_CECCSR_CC_Msk

#define    FLASH_DECCSR_PERRIF_Pos                                (8U)
#define    FLASH_DECCSR_PERRIF_Msk                                (0x1U << FLASH_DECCSR_PERRIF_Pos)
#define    FLASH_DECCSR_PERRIF                                    FLASH_DECCSR_PERRIF_Msk

#define    FLASH_ECCCR_CECCR_Pos                                  (8U)
#define    FLASH_ECCCR_CECCR_Msk                                  (0xffU << FLASH_ECCCR_CECCR_Pos)
#define    FLASH_ECCCR_CECCR                                      FLASH_ECCCR_CECCR_Msk

#define    FLASH_ECCCR_DECCR_Pos                                  (0U)
#define    FLASH_ECCCR_DECCR_Msk                                  (0xffU << FLASH_ECCCR_DECCR_Pos)
#define    FLASH_ECCCR_DECCR                                      FLASH_ECCCR_DECCR_Msk

#define    FL_FLASH_ERASE_KEY                                    (0x96969696U)
#define    FL_FLASH_CHIP_ERASE_KEY                               (0x7D7D7D7DU)
#define    FL_FLASH_PAGE_ERASE_KEY                               (0xEAEAEAEAU)
#define    FL_FLASH_SECTOR_ERASE_KEY                             (0xEAEAEAEAU)
#define    FL_FLASH_ERASE_REQUEST                                (0x1234ABCDU)
#define    FL_FLASH_PROGRAM_KEY1                                 (0xA5A5A5A5U)
#define    FL_FLASH_PROGRAM_KEY2                                 (0xF1F1F1F1U)
/*8M*/
#define    FL_FLASH_ERASE_TIMEOUT                                (0x00FFFFFFU)

#define    FL_CODEFLASH_ADDRS_ALIGN                               0x00000008U
#define    FL_DATAFLASH_ADDRS_ALIGN                               0x00000004U

#define    FL_FLASH_CODE_MAX_PAGE_NUM                            (0x00000200U)
#define    FL_FLASH_CODE_MAX_SECTOR_NUM                          (0x00000080U)
#define    FL_FLASH_CODE_SECTOR_SIZE_BYTE                        (0x00000800U)
#define    FL_FLASH_CODE_PAGE_SIZE_BYTE                          (0x00000200U)
#define    FL_FLASH_CODE_ADDR_MAXPROGRAM                         (0x0003FFFFU)

